{
"Asara B'Tevet": "צום המציין את המצור על ירושלים",
"Ben-Gurion Day": "יום המציין את חייו וחזונו של ראש הממשלה הראשון של ישראל, דוד בן-גוריון",
"Birkat Hachamah": "ברכה יהודית נדירה הנאמרת אחת ל-28 שנים כהודיה לאל על בריאת החמה",
"Chag HaBanot": "חג הבנות של חנוכה (עיד אל-בנאת), שמקורו ביהדות צפון אפריקה ונשתמר בעיקר בתוניסיה",
"Chanukah": "חנוכה, חג החנוכה מחדש היהודי. ידוע גם כחג האורים; החג נחגג במשך שמונה ימים על ידי הדלקת נרות בחנוכייה",
"Days of the Omer": "7 שבועות מהלילה השני של פסח ועד ליום לפני שבועות. נקרא גם ספירת העומר; מנהג הכולל ספירה מילולית של כל אחד מארבעים ותשעה הימים בין שני החגים",
"Erev Yom Kippur": "ערב יום הכיפורים, הכולל את תפילת כל נדרי. צום יום הכיפורים מתחיל עם שקיעת החמה ונמשך 25 שעות",
"Family Day": "יום המשפחה, יום להוקרת התא המשפחתי",
"Hebrew Language Day": "יום לקידום השפה העברית בישראל וברחבי העולם. חל ביום הולדתו של אליעזר בן יהודה, מחייה השפה העברית",
"Herzl Day": "יום המציין את חייו וחזונו של המנהיג הציוני בנימין זאב הרצל",
"Jabotinsky Day": "יום המציין את חייו וחזונו של המנהיג הציוני זאב ז'בוטינסקי",
"Lag BaOmer": "היום ה-33 לספירת העומר. החג מהווה הפוגה זמנית ממנהגי האבלות של תקופת ספירת העומר. המנהגים כוללים הדלקת מדורות, תספורות וחתונות",
"Leil Selichot": "תפילות סליחה כהכנה לימים הנוראים",
"Pesach Sheni": "פסח שני, חודש לאחר חג הפסח",
"Pesach": "פסח, חג המצות. מציין את יציאת מצרים ושחרור בני ישראל ממצרים העתיקה",
"Purim Katan": "חגיגת פורים קטן המצוינת במהלך חודש אדר א' בשנים מעוברות",
"Purim": "חגיגת ההצלה היהודית כפי שמסופר במגילת אסתר. מציין תקופה שבה העם היהודי שחי בפרס ניצל מהשמדה",
"Purim Meshulash": "פורים משולש, הנפרש על פני 3 ימים בירושלים ובערים מוקפות חומה. חל כאשר ט\"ו באדר נופל בשבת",
"Rosh Chodesh Nisan": "תחילת חודש ניסן בלוח העברי. ניסן הוא החודש ה-7 בשנה העברית האזרחית (ה-8 בשנים מעוברות) והחודש ה-1 בשנה העברית המקראית. יש בו 30 ימים והוא מקביל למרץ או אפריל בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Iyyar": "תחילת חודש אייר בלוח העברי. אייר הוא החודש ה-8 בשנה העברית האזרחית (ה-9 בשנים מעוברות) והחודש ה-2 בשנה העברית המקראית. יש בו 29 ימים והוא מקביל לאפריל או מאי בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Sivan": "תחילת חודש סיוון בלוח העברי. סיוון הוא החודש ה-9 בשנה העברית האזרחית (ה-10 בשנים מעוברות) והחודש ה-3 בשנה העברית המקראית. יש בו 30 ימים והוא מקביל למאי או יוני בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Tamuz": "תחילת חודש תמוז בלוח העברי. תמוז הוא החודש ה-10 בשנה העברית האזרחית (ה-11 בשנים מעוברות) והחודש ה-4 בשנה העברית המקראית. יש בו 29 ימים והוא מקביל ליוני או יולי בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Av": "תחילת חודש אב בלוח העברי. אב הוא החודש ה-11 בשנה העברית האזרחית (ה-12 בשנים מעוברות) והחודש ה-5 בשנה העברית המקראית. יש בו 30 ימים והוא מקביל ליולי או אוגוסט בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Elul": "תחילת חודש אלול בלוח העברי. אלול הוא החודש ה-12 בשנה העברית האזרחית (ה-13 בשנים מעוברות) והחודש ה-6 בשנה העברית המקראית. יש בו 29 ימים והוא מקביל לאוגוסט או ספטמבר בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Cheshvan": "תחילת חודש חשוון בלוח העברי. חשוון הוא החודש ה-2 בשנה העברית האזרחית והחודש ה-8 בשנה העברית המקראית. יש בו 29 או 30 ימים והוא מקביל לאוקטובר או נובמבר בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Kislev": "תחילת חודש כסלו בלוח העברי. כסלו הוא החודש ה-3 בשנה העברית האזרחית והחודש ה-9 בשנה העברית המקראית. יש בו 30 או 29 ימים והוא מקביל לנובמבר או דצמבר בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Tevet": "תחילת חודש טבת בלוח העברי. טבת הוא החודש ה-4 בשנה העברית האזרחית והחודש ה-10 בשנה העברית המקראית. יש בו 29 ימים והוא מקביל לדצמבר או ינואר בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Sh'vat": "תחילת חודש שבט בלוח העברי. שבט הוא החודש ה-5 בשנה העברית האזרחית והחודש ה-11 בשנה העברית המקראית. יש בו 30 ימים והוא מקביל לינואר או פברואר בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Adar": "תחילת חודש אדר בלוח העברי. אדר הוא החודש ה-6 בשנה העברית האזרחית והחודש ה-12 בשנה העברית המקראית. יש בו 29 ימים והוא מקביל לפברואר או מרץ בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Adar I": "תחילת חודש אדר א' (בשנים מעוברות) בלוח העברי. אדר א' הוא החודש ה-6 בשנה העברית האזרחית והחודש ה-12 בשנה העברית המקראית. יש בו 30 ימים, הוא חל רק בשנים מעוברות ומקביל לפברואר או מרץ בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Chodesh Adar II": "תחילת חודש אדר ב' (בשנים מעוברות) בלוח העברי. אדר ב', נקרא לעיתים \"אדר שני\", הוא החודש ה-7 בשנה העברית האזרחית והחודש ה-13 בשנה העברית. יש בו 29 ימים, הוא חל רק בשנים מעוברות ומקביל לפברואר או מרץ בלוח הגרגוריאני. ראש חודש הוא מועד המצוין בתחילת כל חודש בלוח העברי ומסומן על ידי מולד הלבנה",
"Rosh Hashana": "ראש השנה היהודי",
"Rosh Hashana LaBehemot": "ראש השנה למעשר בהמה",
"Shabbat Chazon": "שבת חזון (שבת הנבואה). השבת שלפני תשעה באב",
"Shabbat HaChodesh": "שבת החודש. השבת שלפני ראש חודש ניסן. נקראת כהכנה לפסח",
"Shabbat HaGadol": "שבת הגדול. השבת שלפני חג הפסח",
"Shabbat Machar Chodesh": "שבת מחר חודש. כאשר שבת חלה ביום שלפני ראש חודש",
"Shabbat Mevarchim Chodesh": "שבת מברכים. השבת שקודמת לראש חודש, בה הקהל מברך את החודש החדש שבפתח",
"Shabbat Nachamu": "שבת נחמו. השבת שלאחר תשעה באב (שבת של נחמה). הראשונה מבין שבע שבתות המובילות לראש השנה. נקראת על שם ההפטרה (ישעיהו מ') הפותחת בפסוק \"נַחֲמוּ נַחֲמוּ, עַמִּי\"",
"Shabbat Parah": "שבת פרה (אדומה). השבת שלפני שבת החודש, כהכנה לפסח",
"Shabbat Rosh Chodesh": "שבת ראש חודש. כאשר שבת חלה בראש חודש",
"Shabbat Shekalim": "שבת שקלים. השבת שלפני ראש חודש אדר. נקראת כהכנה לפורים",
"Shabbat Shirah": "שבת שירה. השבת הכוללת את פרשת בשלח (ושירת הים)",
"Shabbat Shuva": "שבת שובה. השבת שחלה במהלך עשרת ימי תשובה בין ראש השנה ליום כיפור",
"Shabbat Zachor": "שבת זכור. השבת שלפני פורים",
"Shavuot": "חג השבועות. מציין את מתן תורה בהר סיני",
"Shmini Atzeret": "שמיני עצרת. חל מיד לאחר סוכות; בתפוצות נחגג כחג נפרד ובישראל משולב עם שמחת תורה",
"Shushan Purim": "פורים הנחגג בירושלים ובערים מוקxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxים ובערים מוקפות חומה (בשנה מעוברת)",
"Sigd": "הסיגד, חג של יהדות אתיופיה החל 50 יום לאחר יום הכיפורים",
"Simchat Torah": "שמחת תורה. חגיגה המציינת את סיום המחזור השנתי של קריאת התורה בציבור, ותחילתו של מחזור חדש",
"Sukkot": "חג הסוכות. החג שנמשך שבעה ימים הוא אחד משלושת הרגלים",
"Ta'anit Bechorot": "תענית בכורות",
"Ta'anit Esther": "תענית אסתר",
"Tish'a B'Av": "תשעה באב. צום המציין את חורבן שני בתי המקדש",
"Tu B'Av": "ט\"ו באב, חג האהבה היהודי. מצוין בט\"ו בחודש אב העברי",
"Tu BiShvat": "ראש השנה לאילנות. ט\"ו בשבט הוא אחד מארבעת \"ראשי השנה\" המוזכרים במשנה",
"Tzom Gedaliah": "צום גדליה (צום החודש השביעי). מציין את רצח המושל היהודי של יהודה",
"Tzom Tammuz": "צום י\"ז בתמוז. צום המציין את הבקעת חומות ירושלים לפני חורבן בית המקדש השני",
"Yitzhak Rabin Memorial Day": "יום הזיכרון ליצחק רבין. מציין את חייו של ראש ממשלת ישראל יצחק רבין",
"Yom HaAliyah": "יום העלייה. מציין את העלייה למדינת ישראל",
"Yom HaAliyah School Observance": "יום העלייה כפי שמצוין בבתי הספר בישראל",
"Yom HaAtzma'ut": "יום העצמאות. מציין את הכרזת העצמאות של ישראל בשנת 1948. למרות שיום העצמאות מצוין בדרך כלל בה' באייר, הוא עשוי להיות מוקדם או להידחות אם קיום החג (או יום הזיכרון שתמיד קודם לו) יתנגש עם השבת",
"Yom HaShoah": "יום הזיכרון לשואה ולגבורה",
"Yom HaZikaron": "יום הזיכרון לחללי מערכות ישראל. זוכר את אלו שנפלו במלחמת העצמאות ובמלחמות ישראל האחרות. השם המלא של החג הוא \"יום הזיכרון לחללי מערכות ישראל ולנפגעי פעולות האיבה\". למרות שיום הזיכרון מצוין בדרך כלל בד' באייר, הוא עשוי להיות מוקדם או להידחות אם קיום היום (או יום העצמאות שבא תמיד אחריו) יתנגש עם השבת",
"Yom Kippur": "יום הכיפורים. היום הקדוש ביותר בשנה ביהדות, המצוין באופן מסורתי בצום של 25 שעות ותפילה אינטנסיבית",
"Yom Kippur Katan": "יום כיפור קטן. יום כפרה החל מדי חודש ביום שלפני כל ראש חודש",
"Yom Yerushalayim": "יום ירושלים. מציין את איחודה מחדש של ירושלים בשנת 1967"
}