{
"Asara B'Tevet": "Fast commemorating the siege of Jerusalem",
"Chanukah": "The Jewish festival of rededication, also known as the Festival of Lights. Sometimes spelled Hanukkah, Chanukkah, Hanukah, or Hannukah",
"Days of the Omer": "7 weeks from the second night of Pesach to the day before Shavuot",
"Lag BaOmer": "33rd day of counting the Omer",
"Leil Selichot": "Prayers for forgiveness in preparation for the High Holidays",
"Pesach Sheni": "Second Passover, one month after Passover",
"Pesach": "Passover, the Feast of Unleavened Bread. Also called Chag HaMatzot (the Festival of Matzah), it commemorates the Exodus and freedom of the Israelites from ancient Egypt",
"Purim Katan": "Minor Purim celebration during Adar I on leap years",
"Purim": "Purim is one of the most joyous and fun holidays on the Jewish calendar. It commemorates a time when the Jewish people living in Persia were saved from extermination",
"Rosh Chodesh Adar I": "Beginning of new Hebrew month of Adar I (on leap years). Adar I is the 12th month of the Hebrew year. Corresponds to February or March on the Gregorian calendar",
"Rosh Chodesh Adar II": "Beginning of new Hebrew month of Adar II (on leap years). Adar II (sometimes \"Adar Bet\" or \"Adar Sheni\") is the 13th month of the Hebrew year, ocurring only on leap years. Corresponds to February or March on the Gregorian calendar",
"Rosh Chodesh Adar": "Beginning of new Hebrew month of Adar. Adar is the 12th month of the Hebrew year. Corresponds to February or March on the Gregorian calendar",
"Rosh Chodesh Av": "Beginning of new Hebrew month of Av. Av is the 5th month of the Hebrew year. Corresponds to July or August on the Gregorian calendar",
"Rosh Chodesh Cheshvan": "Beginning of new Hebrew month of Cheshvan. Cheshvan is the 8th month of the Hebrew year. Corresponds to October or November on the Gregorian calendar",
"Rosh Chodesh Elul": "Beginning of new Hebrew month of Elul. Elul is the 6th month of the Hebrew year. Corresponds to August or September on the Gregorian calendar",
"Rosh Chodesh Iyyar": "Beginning of new Hebrew month of Iyyar. Iyyar (somtimes transliterated Iyar) is the 2nd month of the Hebrew year. Corresponds to April or May on the Gregorian calendar",
"Rosh Chodesh Kislev": "Beginning of new Hebrew month of Kislev. Kislev is the 9th month of the Hebrew year. Corresponds to November or December on the Gregorian calendar",
"Rosh Chodesh Nisan": "Beginning of new Hebrew month of Nisan. Nisan (sometimes transliterated Nissan) is the 1st month of the Hebrew year. rresponds to March or April on the Gregorian calendar",
"Rosh Chodesh Sh'vat": "Beginning of new Hebrew month of Sh'vat. Sh'vat (sometimes transliterated Shevat) is the 11th month of the Hebrew year. Corresponds to January or February on the Gregorian calendar",
"Rosh Chodesh Sivan": "Beginning of new Hebrew month of Sivan. Sivan is the 3rd month of the Hebrew year. Corresponds to May or June on the Gregorian calendar",
"Rosh Chodesh Tamuz": "Beginning of new Hebrew month of Tamuz. Tamuz (sometimes transliterated Tammuz) is the 4th month of the Hebrew year. Corresponds to June or July on the Gregorian calendar",
"Rosh Chodesh Tevet": "Beginning of new Hebrew month of Tevet. Tevet is the 10th month of the Hebrew year. Corresponds to December or January on the Gregorian calendar",
"Rosh Hashana": "The Jewish New Year. Also spelled Rosh Hashanah",
"Shabbat Chazon": "Shabbat before Tish'a B'Av (Shabbat of Prophecy/Shabbat of Vision)",
"Shabbat HaChodesh": "Shabbat before Rosh Chodesh Nissan",
"Shabbat HaGadol": "Shabbat before Pesach",
"Shabbat Machar Chodesh": "When Shabbat falls the day before Rosh Chodesh",
"Shabbat Nachamu": "Shabbat after Tish'a B'Av (Shabbat of Consolation). The first of seven Shabbatot leading up to Rosh Hashanah. Named after the Haftarah (from Isaiah 40) which begins with the verse נַחֲמוּ נַחֲמוּ, עַמִּי (\"Comfort, oh comfort my people\")",
"Shabbat Parah": "Shabbat of the Red Heifer",
"Shabbat Rosh Chodesh": "When Shabbat falls on Rosh Chodesh",
"Shabbat Shekalim": "Shabbat before Rosh Chodesh Adar",
"Shabbat Shuva": "Shabbat that falls between Rosh Hashanah and Yom Kippur (Shabbat of Returning)",
"Shabbat Zachor": "Shabbat before Purim",
"Shavuot": "Festival of Weeks, commemorates the giving of the Torah at Mount Sinai",
"Shmini Atzeret": "Eighth Day of Assembly",
"Shushan Purim": "Purim celebrated in Jerusalem and walled cities",
"Sigd": "Ethiopian Jewish holiday occurring 50 days after Yom Kippur",
"Simchat Torah": "Day of Celebrating the Torah",
"Sukkot": "Feast of Tabernacles",
"Ta'anit Bechorot": "Fast of the First Born",
"Ta'anit Esther": "Fast of Esther",
"Tish'a B'Av": "The Ninth of Av, fast commemorating the destruction of the two Temples",
"Tu B'Av": "minor Jewish holiday of love, observed on the 15th day of the Hebrew month of Av",
"Tu BiShvat": "New Year for Trees",
"Tzom Gedaliah": "Fast of the Seventh Month, commemorates the assassination of the Jewish governor of Judah",
"Tzom Tammuz": "Fast commemorating breaching of the walls of Jerusalem before the destruction of the Second Temple",
"Yom HaAliyah": "Recognizes Aliyah, immigration to the Jewish State of Israel",
"Yom HaAtzma'ut": "Israeli Independence Day. Commemorates the declaration of independence of Israel in 1948. Note that Hebcal displays modern holidays like Yom HaAtzma'ut according to the Israeli schedule. Although Yom HaAtzma'ut is normally observed on the 5th of Iyyar, it may be moved earlier or postponed if observance of the holiday (or Yom HaZikaron, which always preceeds it) would conflict with Shabbat",
"Yom HaShoah": "Holocaust Memorial Day",
"Yom HaZikaron": "Israeli Memorial Day. Note that Hebcal displays modern holidays like Yom HaZikaron according to the Israeli schedule. Although Yom Hazikaron is normally observed on the 4th of Iyyar, it may be moved earlier or postponed if observance of the holiday (or Yom HaAtzma'ut, which always follows it) would conflict with Shabbat",
"Yom Kippur": "Day of Atonement",
"Yom Yerushalayim": "Jerusalem Day. Commemorates the re-unification of Jerusalem in 1967"
}
